HomiKetalys/gd32ai-modelzoo/object_detection/yolo_fastestv2/deployment/gd32h759IMK6_ARMCC/main.c
//检测一次
void detect_once(void)
{
	while(!((1 == get_frame_flag())));
	u32 i,x, y,t0,t1,t2;
	char str[128];
	u16 *frame=(u16 *) frame_addr;
	
	time_start();
	
	t0=get_time_stamp();
	AI_Run((u8 *)frame);
	t1=get_time_stamp();
	t0=t1-t0;


	//将结果显示在屏幕
	t1=get_time_stamp();
	for(y = 24; y <= LCD_Y-1; y++)
	{
		for(x = 0; x <= LCD_X-1; x++)
		{
			if((x>=SHOW_X0)&&(x<=SHOW_X1)&&(y>=SHOW_Y0)&&(y<=SHOW_Y1))
				LCDDrawPoint(x, y, frame[IMAGE_HEIGHT*IMAGE_WIDTH-1-(y-SHOW_Y0)*IMAGE_WIDTH-(x-SHOW_X0)]);
			else
				LCDDrawPoint(x, y, 0xffff);
		}
	}
#ifndef TEST_TIME
	
	for(i=0;i<object_num;i++)
	{
		LCDShowString(SHOW_X0+(u32)results[i].bbox.x_min,SHOW_Y0+(u32)results[i].bbox.y_min-16,480-1,16,LCD_FONT_16,LCD_TEXT_TRANS,0x07f0,0xffff,(char *) activities[results[i].cls_index]);
		LCDDrawRectangle(SHOW_X0+(u32)results[i].bbox.x_min,SHOW_Y0+(u32)results[i].bbox.y_min,SHOW_X0+(u32)results[i].bbox.x_max,SHOW_Y0+(u32)results[i].bbox.y_max,0xfff0);
	}
#endif
	t2=get_time_stamp();
	t1=t2-t1;
	
	u32 sys=rcu_clock_freq_get(CK_SYS)/1000000;
	u32 ahb=rcu_clock_freq_get(CK_AHB)/1000000;
	u32 apb1=rcu_clock_freq_get(CK_APB1)/1000000;
	u32 apb2=rcu_clock_freq_get(CK_APB2)/1000000;

 
	sprintf(str,"infer_time:%dms",t0);
	LCDShowString(0,24*1,24*20-1,24,LCD_FONT_24,LCD_TEXT_NORMAL,0,0xffff,str);
	sprintf(str,"display_time:%dms",t1);
	LCDShowString(0,24*2,24*20-1,24,LCD_FONT_24,LCD_TEXT_NORMAL,0,0xffff,str);
	sprintf(str,"SYS:%dMHz",sys);
	LCDShowString(0,24*3,24*10-1,24,LCD_FONT_24,LCD_TEXT_NORMAL,0,0xffff,str);
	sprintf(str,"AHB:%dMHz",ahb);
	LCDShowString(0,24*4,24*10-1,24,LCD_FONT_24,LCD_TEXT_NORMAL,0,0xffff,str);
	sprintf(str,"APB1:%dMHz",apb1);
	LCDShowString(0,24*5,24*10-1,24,LCD_FONT_24,LCD_TEXT_NORMAL,0,0xffff,str);
	sprintf(str,"APB2:%dMHz",apb2);
	LCDShowString(0,24*6,24*10-1,24,LCD_FONT_24,LCD_TEXT_NORMAL,0,0xffff,str);
	
	//开启下一帧传输
	clear_frame_flag();
	ConfigDCI();
}


/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    ov2640_id_struct ov2640id;

    /* enable the CPU cache */
    cache_enable();
	
		
    systick_config();
    nvic_configuration();

    /* SDRAM initialization */
    exmc_synchronous_dynamic_ram_init(EXMC_SDRAM_DEVICE0);
    delay_1ms(1000);
    /* key configuration */
//    key_config();

    /* camera initialization */
    dci_ov2640_init();
    dci_ov2640_id_read(&ov2640id);

    /* DMA interrupt and channel enable */
//    dma_interrupt_enable(DMA1, DMA_CH7, DMA_CHXCTL_FTFIE);
//    dma_channel_enable(DMA1, DMA_CH7);
    /* DCI enable */
//    dci_enable();
//    dci_capture_enable();
//    delay_1ms(100);

    /* LCD configure and TLI enable */
//    lcd_config();
//    tli_layer_enable(LAYER0);
//    tli_layer_enable(LAYER1);
//    tli_reload_config(TLI_REQUEST_RELOAD_EN);
//    tli_enable();
    InitLCD();
		LCDDisplayDir(LCD_SCREEN_VERTICAL);
//		LCDDrawPoint(0, 1, 0x07e0);
//		LCDShowString(0,240,240-1,16,LCD_FONT_16,LCD_TEXT_TRANS,0x07f0,0xffff,"hahaha");
		/* configure USART0 */
//    usart_config();
		timer_config();
		
		
//		int i;
//		for(i=0;i<256*256;i++)
//		{
//			frame[i]=0xffff;
//		}
		
		AI_Init(IMAGE_WIDTH,IMAGE_HEIGHT,0);
		LCDFillPixel(0,0,272-1,480-1,0xffff);
	  LCDShowString(0,0,272-1,32,LCD_FONT_24,LCD_TEXT_NORMAL,0,0xffff,"results:");

		void detect_once();
    while(1) {
			detect_once();
    }
}

/*!
    \brief      enable the CPU cache
    \param[in]  none
    \param[out] none
    \retval     none
*/
void cache_enable(void)
{
    /* enable I-Cache and D-Cache */
    SCB_EnableICache();
    SCB_EnableDCache();
//    SCB_DisableICache();
//    SCB_DisableDCache();
}

/*!
    \brief      LCD configuration
    \param[in]  none
    \param[out] none
    \retval     none
*/
void lcd_config(void)
{
    rcu_periph_clock_enable(RCU_TLI);
    tli_gpio_config();

    /* configure PLL2 to generate TLI clock 25MHz/25*216/3 = 72MHz */
    rcu_pll_input_output_clock_range_config(IDX_PLL2, RCU_PLL2RNG_1M_2M, RCU_PLL2VCO_150M_420M);
    if(ERROR == rcu_pll2_config(25, 188, 3, 3, 3)) {
        while(1) {
        }
    }
    rcu_pll_clock_output_enable(RCU_PLL2R);
    rcu_tli_clock_div_config(RCU_PLL2R_DIV8);
    rcu_osci_on(RCU_PLL2_CK);

    if(ERROR == rcu_osci_stab_wait(RCU_PLL2_CK)) {
        while(1) {
        }
    }

    /* TLI initialization */
    /* initialize the horizontal synchronization polarity as active low */
    tli_initstruct.signalpolarity_hs = TLI_HSYN_ACTLIVE_LOW;
    /* initialize the vertical synchronization polarity as active low */
    tli_initstruct.signalpolarity_vs = TLI_VSYN_ACTLIVE_LOW;
    /* initialize the data enable polarity as active low */
    tli_initstruct.signalpolarity_de = TLI_DE_ACTLIVE_LOW;
    /* initialize the pixel clock polarity as input pixel clock */
    tli_initstruct.signalpolarity_pixelck = TLI_PIXEL_CLOCK_TLI;

    /* timing configuration */
    /* configure horizontal synchronization width */
    tli_initstruct.synpsz_hpsz = 40;
    /* configure vertical synchronization height */
    tli_initstruct.synpsz_vpsz = 9;
    /* configure accumulated horizontal back porch */
    tli_initstruct.backpsz_hbpsz = 42;
    /* configure accumulated vertical back porch */
    tli_initstruct.backpsz_vbpsz = 11;
    /* configure accumulated active width */
    tli_initstruct.activesz_hasz = 522;
    /* configure accumulated active height */
    tli_initstruct.activesz_vasz = 283;
    /* configure total width */
    tli_initstruct.totalsz_htsz = 524;
    /* configure total height */
    tli_initstruct.totalsz_vtsz = 285;

    /* configure R,G,B component values for LCD background color */
    tli_initstruct.backcolor_red = 0xFF;
    tli_initstruct.backcolor_green = 0xFF;
    tli_initstruct.backcolor_blue = 0xFF;

    tli_init(&tli_initstruct);

    /* layer0 windowing configuration */
    tli_layer0_initstruct.layer_window_leftpos = 45;
    tli_layer0_initstruct.layer_window_rightpos = (43 + 480 - 1);
    tli_layer0_initstruct.layer_window_toppos =  12;
    tli_layer0_initstruct.layer_window_bottompos = (12 + 272 - 1);

    /* pixel format configuration */
    tli_layer0_initstruct.layer_ppf = LAYER_PPF_RGB565;

